import time
from time import sleep
usr = input("Введіть ваше ім'я: ")
print(f"Вітаю тебе на тесті, {usr}!")
time.sleep(1.5)
print("Це продовження того, що зробив Міша!")
time.sleep(1.5)
print("Я надіюся ви запам'ятали те, що він вам показував?")
time.sleep(1.5)
print("У вас тільки одна спроба на кожне питання! Будьте уважними!")
time.sleep(1.5)
ready_ques = input("Ви хочете розпочати тест?: ")
if ready_ques == "так":
    print("Тоді розпочинаймо!")
else:
    print("Хех, відповідь 'ні' не приймається, і так почнемо")
ques1 = input("Якого року народився Фрідріх Шиллер?: ")
if ques1 == "1759":
    print("Правильно! переходимо до наступного питання!")
else:
    print("Не правильно!")
ques2 = input("Яке його повне ім'я?: ")
if ques2 == "Йоганн Фрідріх Шиллер":
    print("Правильно!")
else:
    print("Не правильно!")
ques3 = input("З яким Німецьким поетом він став друзями?: ")
if ques3 == "Йоганн Вольфганг Гете":
    print("Правильно!")
else:
    print("Не правильно!")
ques4 = input("Який твір Шиллера ми читали?: ")
if ques4 == "Рукавичка":
    print("Правильно!")
else:
    print("Не правильно!")
ques5 = input("Ким був Батько Шиллера?: ")
if ques5 == "полковим лікарем":
    print("Правильно!")
else:
    print("Не правильно!")
ques6 = input("В якому році Шиллер вступив до Військової Академії?: ")
if ques6 == "1773":
    print("Правильно!")
else:
    print("Не правильно!")
ques7 = input("У якому році він отримав заборону на написання будь яких Літературних творів?: ")
if ques7 == "1783":
    print("Правильно!")
else:
    print("Не правильно!")
ques8 = input("У якому році імператор Священної Римської Імперії: Франц II надав Шиллеру дворянство?: ")
if ques8 == "1802":
    print("Правильно!")
else:
    print("Не правильно!")
ques9 = input("У якому році помер Йоганн Фрідріх Шиллер?: ")
if ques9 == "1805":
    print("Правильно!")
else:
    print("Не правильно!")
ques10 = input("Як було звати імператора Священної Римської Імперії?: ")
if ques10 == "Франц II":
    print("Правильно!")
else:
    print("Не правильно!")
time.sleep(2)
ques11 = input("Назви ще два відомі твори Шиллера, окрім “Рукавички”")
if ques11 == "'Вільгельм Телль' і 'Розбійники'":
    print("Правильно!")
else:
    print("Не правильно!")
time.sleep(2)
ques12 = input("У якому місті похований Шиллер?")
if ques12 == "У Веймарі":
    print("Правильно!")
else:
    print("Не правильно!")
time.sleep(2)
ques13 = input("Хто головні герої у творі «Рукавичка»?")
if ques13 == "Делорж і Куніґунда":
    print("Правильно!")
else:
    print("Не час здаватись!")
time.sleep(2)
ques14 = input("Яке враження, на твою думку, має залишити поема “Рукавичка”?")
if ques14 == "Шляхетність, гідність, сміливість":
    print("Молодець, ще залишилось трохи!")
else:
    print("Не правильно!")
time.sleep(2)
ques15 = input("Якою була основна ідея творчості Шиллера?")
if ques15 == "Віра в свободу, честь, мораль і гідність людини":
    print("Вітаю ти пройшов тест!")
else:
    print("Нажаль це неправильно... Але інше все так!")
time.sleep(2)
print("Це були всі питання! Це кінець тесту!")
time.sleep(2)
print("Дякую за увагу! :)")
time.sleep(3)
print("\033[H\033[2J", end="")
